#ให้เขียนโปรแกรมรับจำนวนเต็มระหว่าง 0 ถึง 99 จากนั้นแสดงแผนภาพฮิสโตแกรมที่แสดงความถี่ของข้อมูล อย่างไรก็ตาม ในการแสดงให้แสดงเป็นกลุ่ม กลุ่มแรกมีค่าตั้งแต่ 0 - 9 กลุ่มที่สองมีค่าตั้งแต่ 10 - 19 จนถึงกลุ่มสุดท้ายเป็น 90 - 99 ตามลำดับ ในการแสดงไม่ต้องพิมพ์หมายเลขกลุ่ม 

#โปรแกรมจะรับข้อมูลจากผู้ใช้จนกระทั่งผู้ใช้ป้อนข้อมูลที่น้อยกว่า 0 

#ในการแสดงฮิสโตแกรมให้แสดงความถี่ด้วยเครื่องหมาย * 

#Example

#9
#10
#95
#15
#32
#91
#12
#-100
#: * 
#: ***
#: 
#: *
#: 
#:
#: 
#: 
#: 
#: **

n = [[],[],[],[],[],[],[],[],[],[]]
x = int(input(''))

while x >= 0 and x < 100:
    
    for i in range(10):
        if x == i:
            n[0].append('*')
        elif x == i + 10:
            n[1].append('*')
        elif x == i + 20:
            n[2].append('*')
        elif x == i + 30:
            n[3].append('*')
        elif x == i + 40:
            n[4].append('*')
        elif x == i + 50:
            n[5].append('*')
        elif x == i + 60:
            n[6].append('*')
        elif x == i + 70:
            n[7].append('*')
        elif x == i + 80:
            n[8].append('*')
        elif x == i + 90:
            n[9].append('*')
    x = int(input(''))
    
for j in range(10):
    sum = ''
    for y in n[j]:
        sum = sum + y
    print(f'{j} : {sum}')
    