#ให้เขียนโปรแกรมรับจำนวนเต็มระหว่าง 0 ถึง 9 จากนั้นแสดงแผนภาพฮิสโตแกรมที่แสดงความถี่ของข้อมูลแต่ละตัวที่ได้รับมา 

#โปรแกรมจะรับข้อมูลจากผู้ใช้จนกระทั่งผู้ใช้ป้อนข้อมูลที่น้อยกว่า 0 

#ในการแสดงฮิสโตแกรมให้แสดงความถี่ด้วยเครื่องหมาย * 

#Example

#0
#1
#9
#1
#3
#9
#1
#-100
#0 : *
#1 : ***
#2 : 
#3 : *
#4 : 
#5 : 
#6 : 
#7 : 
#8 : 
#9 : **

#หมายเหตุ: สามารถใช้ตัวดำเนินการ * กับสตริงเพื่อให้เป็นสตริงที่ซ้ำ ๆ กันได้ เช่น "*" * 10 มีค่าเป็น "**********"

n = [[],[],[],[],[],[],[],[],[],[]]
x = int(input(''))

while x >= 0:
    for i in range(10):
        if x == i:
            n[i].append('*')
    x = int(input(''))
    
for j in range(10):
    sum = ''
    for y in n[j]:
        sum = sum + y
    print(f'{j} : {sum}')
    